# 1
# ოცემულია სეტი A = {1, 2, 3, 4, 5}. დაწერე ამ სეტის ელემენტების რაოდენობა. ჩაწერე, არის თუ არა 3 სეტის ელემენტი.
# დაამატე რიცხვი 6 ამ სეტში. ამოიღე რიცხვი 2 სეტიდან.

# დაწერე ამ სეტის ელემენტების რაოდენობა.
A = {1, 2, 3, 4, 5}  
print("ელემენტების რაოდენობა:", len(A))

# ჩაწერე, არის თუ არა 3 სეტის ელემენტი.
A = {1, 2, 3, 4, 5}
print("არის თუ არა 3 სეტის ელემენტი?", 3 in A)

# დაამატე რიცხვი 6 ამ სეტში.
A = {1, 2, 3, 4, 5}
A.add(6)
print(A)

# ამოიღე რიცხვი 2 სეტიდან.
A = {1, 2, 3, 4, 5}
A.remove(2)
print(A)