# დავალება N1
# print() - გამოგვაქვს რაღაცა ტერმინალზე
# len() - ვიგებთ ლისტის / სტრინგის სიგრძეს
# int() - ამით ჩვენ რაიმე ელემენტს გარდავქმნით ინტეჯერად 
# str() - ამით ჩვენ რაიმე ელემენტს გარდავქმნით სტრინგათ
# bool() - ამით ჩვენ რაიმე ელემენტს გარდავქმნით ბულიანათ (true და false)
# float() - ამით ჩვენ რაიმე ელემენტს გარდავქმნით ათწილადად
# input() - მომხვარებელს შევაყვანინებთ რაიმე ინფორმაციას
# .append() - ამით ჩვენ შეგვიძლია დავამატოთ რაიმე ელემენტი ლისტში
# .pop() - ამით ჩვენ სეგვიძლია ამოვიღოთ რაიმე ელემენტი ლისტიდან 

# დავალება N2
# def ფუნქციას ჩვენ ვქმნით შემდეგნაირად :

def hello_name(name):
    print(f"Hello {name}!")

hello_name("soso")

# დავალება N3
user_name = input("please enter your name: ")

def greet(name):
    print(f"hello {name}!")
greet(user_name)